# 과제 1

In [1]:
import pandas as pd 
df_t = pd.read_csv('../data/titanic.csv')

In [2]:
df_t

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,adult_male,embark_town
0,0,3,male,22.0,1,0,7.2500,S,Third,True,Southampton
1,1,1,female,38.0,1,0,71.2833,C,First,False,Cherbourg
2,1,3,female,26.0,0,0,7.9250,S,Third,False,Southampton
3,1,1,female,35.0,1,0,53.1000,S,First,False,Southampton
4,0,3,male,35.0,0,0,8.0500,S,Third,True,Southampton
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,True,Southampton
887,1,1,female,19.0,0,0,30.0000,S,First,False,Southampton
888,0,3,female,NaN,1,2,23.4500,S,Third,False,Southampton
889,1,1,male,26.0,0,0,30.0000,C,First,True,Cherbourg
890,0,3,male,32.0,0,0,7.7500,Q,Third,True,Queenstown

In [ ]:
# Q1. pandas를 import하고 data폴더 안에 있는 titanic.csv 파일 불러오세요

In [2]:
# Q2. 타이타닉 데이터의 결측치가 있는 변수를 확인하세요

In [3]:
# Q3. 타이타닉 데이터에서 survived 변수 (생존 여부) 에서 생존자 수를 구하세요

In [4]:
# Q4. 타이타닉 데이터에 class변수의 unique 값을 구하세요

In [5]:
# Q5. 타이타닉 데이터에 class변수의 value_counts값을 출력하세요

In [6]:
# Q6. 타이타닉 데이터에서 class변수명을 CLASS로 변경하세요

In [7]:
# Q7. 타이타닉 데이터에 age 변수를를 int로 변경하세요

In [8]:
# Q8. embarked변수를 index로 변경하세요